class Solution(object):
    # 歷遍nums，紀錄當前數字為n，將數字n(在數組中是以n-1表示)是為下標，因為a[i]的範圍為1~n
    # 當n第一次出現時，nums[n - 1]乘以-1(以負號當作歷遍記號)
    # 當n出現一次以上時，下標一定會帶負號，將n加入答案

    # [1, 2, 1, 3, 4]
    # ===================================
    # [-1, 2, 1, 3, 4]   將1(1-1=0)[位置] 打上記號
    # [-1, -2, 1, 3, 4]  將2(2-1-1)[位置] 打上記號
    # [-1, -2, 1, 3, 4]  將1(1-1=0)[位置] 打上記號
    # [-1, -2, -1, 3, 4] 將3(3-1=2)[位置] 打上記號
    # [-1, -2, -1, -3, 4]將4(4-1=3)[位置] 打上記號

    def findDuplicates(self, nums):
        """
        :type nums: List[int]
        :rtype: List[int]
        """
        res = []
        for n in nums:
            n = abs(n)

            # 若出現記號則是出現過
            if nums[n - 1] < 0:
                res.append(n)

            # 加上記號
            nums[n - 1] = abs(nums[n - 1]) * -1

        return res
